//CBLDB2A JOB (ACNNT),MSGCLASS=X,NOTIFY=&SYSUID                           00010000
//   EXPORT SYMLIST=(DOB,PNAME)
//RUN  EXEC PGM=IKJEFT01,DYNAMNBR=20
//STEPLIB DD DSN=DB2SYS.SDSNEXIT,DISP=SHR
//       DD DSN=DB2SYS.SDSNLOAD,DISP=SHR
//OUTDD DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSDUMP DD SYSOUT=*
//SYSOUT DD SYSOUT=*
//SYSTSIN DD *
  DSN SYSTEM(DB2SYS)
  RUN PROGRAM(CBLDB2A) -
      PLAN(PLAN) -
      LIB('USER.LOAD')
  END
/*
//SYSIN DD *
%DOB
%PNAME
/*
